<a href="https://colab.research.google.com/github/HIsu1231/AI_INOVATION_SQUARE/blob/master/pandas_basic.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

###파일에서 데이터 불러오기

In [ ]:
df = pd.read_csv('./drive/MyDrive/AI_INOVATION_SQUARE/data/LEC_01_data.csv')

df

    Name Country  Age        Job
0   John     USA   31    Student
1  Sabre  France   33     Lawyer
2    Kim   Korea   28  Developer
3   Sato   Japan   40       Chef
4    Lee   Korea   36  Professor
5  Smith     USA   55        CEO
6  David     USA   48     Banker

In [ ]:
type(df)

pandas.core.frame.DataFrame

In [ ]:
type(df.Name)

pandas.core.series.Series

### 열 데이터 추출하기

In [ ]:
df_job = df['Job']

df_job

0      Student
1       Lawyer
2    Developer
3         Chef
4    Professor
5          CEO
6       Banker
Name: Job, dtype: object

In [ ]:
df_country_job = df[['Country','Job']]
#추출하고자 하는 열이 2개 이상인 경우 리스트 타입으로 기술

df_country_job

  Country        Job
0     USA    Student
1  France     Lawyer
2   Korea  Developer
3   Japan       Chef
4   Korea  Professor
5     USA        CEO
6     USA     Banker

### 행 데이터 추출하기

In [ ]:
df_1st_row = df.loc[0]

df_1st_row

Name          John
Country        USA
Age             31
Job        Student
Name: 0, dtype: object

In [ ]:
df_1st_4th_row = df.loc[[0,3]]
#추출하고자 하는 행이 2개 이상인 경우 리스트 타입으로 기술

df_1st_4th_row

   Name Country  Age      Job
0  John     USA   31  Student
3  Sato   Japan   40     Chef

###Missing Data (NaN, None 등) 처리

In [ ]:
df = pd.read_csv('./drive/MyDrive/AI_INOVATION_SQUARE/data/test_missing_data.csv')

df

    Name Country   Age        Job
0   John     USA  31.0    Student
1  Sabre  France  33.0        NaN
2    Kim   Korea  28.0  Developer
3   Sato     NaN  40.0       Chef
4    Lee   Korea  36.0  Professor
5  Smith     USA  55.0        CEO
6  David     USA   NaN     Banker

In [ ]:
print(len(df.index)) #행 확인
print(len(df.columns)) #열 확인

7
4

isnull(), dropna()

In [ ]:
#missing data 개수 확인
df.isnull().sum()

Name       0
Country    1
Age        1
Job        1
dtype: int64

In [ ]:
#각 열의 data 개수 확인(NaN 제외한 데이터 개수)

print(df['Name'].value_counts())
print("\n")
print(df['Country'].value_counts())

Sabre    1
Sato     1
David    1
John     1
Smith    1
Kim      1
Lee      1
Name: Name, dtype: int64


USA       3
Korea     2
France    1
Name: Country, dtype: int64

In [ ]:
#NaN값이 있는 행 모두 제거

df1 = df.dropna()

df1

    Name Country   Age        Job
0   John     USA  31.0    Student
2    Kim   Korea  28.0  Developer
4    Lee   Korea  36.0  Professor
5  Smith     USA  55.0        CEO

fillna()

In [ ]:
#missing data 특정 값으로 변경 (각 열의 NaN)

df['Country'].fillna('Spain', inplace=True)
df['Age'].fillna(100.0, inplace=True)
df['Job'].fillna('Reporter', inplace=True)

df

    Name Country    Age        Job
0   John     USA   31.0    Student
1  Sabre  France   33.0   Reporter
2    Kim   Korea   28.0  Developer
3   Sato   Spain   40.0       Chef
4    Lee   Korea   36.0  Professor
5  Smith     USA   55.0        CEO
6  David     USA  100.0     Banker

In [ ]:
df_test = pd.read_csv('./drive/MyDrive/AI_INOVATION_SQUARE/data/test_missing_data.csv')

# missing data 특정 값으로 변경 모든 NaN)

df_test.fillna('AAA', inplace=True)

df_test

    Name Country  Age        Job
0   John     USA   31    Student
1  Sabre  France   33        AAA
2    Kim   Korea   28  Developer
3   Sato     AAA   40       Chef
4    Lee   Korea   36  Professor
5  Smith     USA   55        CEO
6  David     USA  AAA     Banker

###데이터 프레임 평균, 중간값

mean(), median()

In [ ]:
df_stat = pd.read_csv('./drive/MyDrive/AI_INOVATION_SQUARE/data/test_missing_data.csv')

df_stat

    Name Country   Age        Job
0   John     USA  31.0    Student
1  Sabre  France  33.0        NaN
2    Kim   Korea  28.0  Developer
3   Sato     NaN  40.0       Chef
4    Lee   Korea  36.0  Professor
5  Smith     USA  55.0        CEO
6  David     USA   NaN     Banker

In [ ]:
print('Age mean = ', df_stat['Age'].mean())
print('Age median = ',df_stat['Age'].median())

Age mean =  37.166666666666664
Age median =  34.5

###열 추가

In [ ]:
df1 = pd.read_csv('./drive/MyDrive/AI_INOVATION_SQUARE/data/test_missing_data.csv')
df2 = pd.read_csv('./drive/MyDrive/AI_INOVATION_SQUARE/data/test_missing_data.csv')

df1['New_Name'] = df2['Name']

df1

    Name Country   Age        Job New_Name
0   John     USA  31.0    Student     John
1  Sabre  France  33.0        NaN    Sabre
2    Kim   Korea  28.0  Developer      Kim
3   Sato     NaN  40.0       Chef     Sato
4    Lee   Korea  36.0  Professor      Lee
5  Smith     USA  55.0        CEO    Smith
6  David     USA   NaN     Banker    David

###열 순서변경

In [ ]:
df1 = df1[['Age', 'Name', 'Job', 'Country']]

df1

    Age   Name        Job Country
0  31.0   John    Student     USA
1  33.0  Sabre        NaN  France
2  28.0    Kim  Developer   Korea
3  40.0   Sato       Chef     NaN
4  36.0    Lee  Professor   Korea
5  55.0  Smith        CEO     USA
6   NaN  David     Banker     USA

In [ ]:
df2 = df2[['Name','Age','Job']]

df2

    Name   Age        Job
0   John  31.0    Student
1  Sabre  33.0        NaN
2    Kim  28.0  Developer
3   Sato  40.0       Chef
4    Lee  36.0  Professor
5  Smith  55.0        CEO
6  David   NaN     Banker